data/cfdb/validation/naca0012_sa_tmr/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Structured C-grid-style mesh for NACA 0012 (TMR altered definition,
// sharp TE), alpha = 0, Re = 6e6. Generated by gen_mesh.py — do not edit
// by hand; regenerate with `python3 gen_mesh.py`.
//
// Farfield: x in [-20, 40], y in +/-20 (chords).
// First wall cell 0.0003 c (y+ ~ 65, wall-function regime).

scale   1;

vertices
(
    (0 0 -0.05)
    (1 0 -0.05)
    (0.5 0.052190197 -0.05)
    (0.5 -0.052190197 -0.05)
    (0 20 -0.05)
    (0 -20 -0.05)
    (0.5 20 -0.05)
    (0.5 -20 -0.05)
    (1 20 -0.05)
    (1 -20 -0.05)
    (-20 0 -0.05)
    (-20 20 -0.05)
    (-20 -20 -0.05)
    (40 0 -0.05)
    (40 20 -0.05)
    (40 -20 -0.05)
    (7.8172341 0 -0.05)
    (7.8172341 20 -0.05)
    (7.8172341 -20 -0.05)
    (0 0 0.05)
    (1 0 0.05)
    (0.5 0.052190197 0.05)
    (0.5 -0.052190197 0.05)
    (0 20 0.05)
    (0 -20 0.05)
    (0.5 20 0.05)
    (0.5 -20 0.05)
    (1 20 0.05)
    (1 -20 0.05)
    (-20 0 0.05)
    (-20 20 0.05)
    (-20 -20 0.05)
    (40 0 0.05)
    (40 20 0.05)
    (40 -20 0.05)
    (7.8172341 0 0.05)
    (7.8172341 20 0.05)
    (7.8172341 -20 0.05)
);

blocks
(
    hex (10 0 4 11 29 19 23 30) (80 55 1) simpleGrading (1 10506.2 1)
    hex (0 2 6 4 19 21 25 23) (40 55 1) simpleGrading (14.6975 10506.2 1)
    hex (2 1 8 6 21 20 27 25) (40 55 1) simpleGrading (0.0707049 10506.2 1)
    hex (1 16 17 8 20 35 36 27) (150 55 1) simpleGrading (80 10506.2 1)
    hex (16 13 14 17 35 32 33 36) (161 55 1) simpleGrading (1 10506.2 1)
    hex (10 12 5 0 29 31 24 19) (55 80 1) simpleGrading (10506.2 1 1)
    hex (0 5 7 3 19 24 26 22) (55 40 1) simpleGrading (10506.2 14.6975 1)
    hex (3 7 9 1 22 26 28 20) (55 40 1) simpleGrading (10506.2 0.0707049 1)
    hex (1 9 18 16 20 28 37 35) (55 150 1) simpleGrading (10506.2 80 1)
    hex (16 18 15 13 35 37 34 32) (55 161 1) simpleGrading (10506.2 1 1)
);

edges
(
    arc 0 4 (-4.1421356 10 -0.05)
    arc 19 23 (-4.1421356 10 0.05)
    arc 0 5 (-4.1421356 -10 -0.05)
    arc 19 24 (-4.1421356 -10 0.05)
    spline 0 2
    (
        (0.0018227815 0.0074332743 -0.05)
        (0.0072645456 0.014555571 -0.05)
        (0.016245939 0.021321306 -0.05)
        (0.028635994 0.027676067 -0.05)
        (0.044254034 0.033560822 -0.05)
        (0.062872313 0.038917001 -0.05)
        (0.084219335 0.043691852 -0.05)
        (0.10798381 0.047843432 -0.05)
        (0.13381921 0.051344695 -0.05)
        (0.16134878 0.054186276 -0.05)
        (0.19017108 0.056377776 -0.05)
        (0.21986583 0.057947524 -0.05)
        (0.25 0.058940989 -0.05)
        (0.28013417 0.059418152 -0.05)
        (0.30982892 0.059450175 -0.05)
        (0.33865122 0.059115776 -0.05)
        (0.36618079 0.058497607 -0.05)
        (0.39201619 0.057678906 -0.05)
        (0.41578066 0.056740568 -0.05)
        (0.43712769 0.055758686 -0.05)
        (0.45574597 0.054802579 -0.05)
        (0.47136401 0.053933221 -0.05)
        (0.48375406 0.053202031 -0.05)
        (0.49273545 0.05264993 -0.05)
        (0.49817722 0.052306641 -0.05)
    )
    spline 19 21
    (
        (0.0018227815 0.0074332743 0.05)
        (0.0072645456 0.014555571 0.05)
        (0.016245939 0.021321306 0.05)
        (0.028635994 0.027676067 0.05)
        (0.044254034 0.033560822 0.05)
        (0.062872313 0.038917001 0.05)
        (0.084219335 0.043691852 0.05)
        (0.10798381 0.047843432 0.05)
        (0.13381921 0.051344695 0.05)
        (0.16134878 0.054186276 0.05)
        (0.19017108 0.056377776 0.05)
        (0.21986583 0.057947524 0.05)
        (0.25 0.058940989 0.05)
        (0.28013417 0.059418152 0.05)
        (0.30982892 0.059450175 0.05)
        (0.33865122 0.059115776 0.05)
        (0.36618079 0.058497607 0.05)
        (0.39201619 0.057678906 0.05)
        (0.41578066 0.056740568 0.05)
        (0.43712769 0.055758686 0.05)
        (0.45574597 0.054802579 0.05)
        (0.47136401 0.053933221 0.05)
        (0.48375406 0.053202031 0.05)
        (0.49273545 0.05264993 0.05)
        (0.49817722 0.052306641 0.05)
    )
    spline 2 1
    (
        (0.50182278 0.052073029 -0.05)
        (0.50726455 0.051718968 -0.05)
        (0.51624594 0.051120856 -0.05)
        (0.52863599 0.050268373 -0.05)
        (0.54425403 0.049150166 -0.05)
        (0.56287231 0.047756292 -0.05)
        (0.58421934 0.046080616 -0.05)
        (0.60798381 0.044122842 -0.05)
        (0.63381921 0.041889956 -0.05)
        (0.66134878 0.039397008 -0.05)
        (0.69017108 0.036667271 -0.05)
        (0.71986583 0.033731895 -0.05)
        (0.75 0.030629248 -0.05)
        (0.78013417 0.0274041 -0.05)
        (0.80982892 0.024106778 -0.05)
        (0.83865122 0.020792354 -0.05)
        (0.86618079 0.017519826 -0.05)
        (0.89201619 0.01435122 -0.05)
        (0.91578066 0.011350478 -0.05)
        (0.93712769 0.0085820368 -0.05)
        (0.95574597 0.0061090083 -0.05)
        (0.97136401 0.0039909915 -0.05)
        (0.98375406 0.0022816119 -0.05)
        (0.99273545 0.0010259797 -0.05)
        (0.99817722 0.00025831402 -0.05)
    )
    spline 21 20
    (
        (0.50182278 0.052073029 0.05)
        (0.50726455 0.051718968 0.05)
        (0.51624594 0.051120856 0.05)
        (0.52863599 0.050268373 0.05)
        (0.54425403 0.049150166 0.05)
        (0.56287231 0.047756292 0.05)
        (0.58421934 0.046080616 0.05)
        (0.60798381 0.044122842 0.05)
        (0.63381921 0.041889956 0.05)
        (0.66134878 0.039397008 0.05)
        (0.69017108 0.036667271 0.05)
        (0.71986583 0.033731895 0.05)
        (0.75 0.030629248 0.05)
        (0.78013417 0.0274041 0.05)
        (0.80982892 0.024106778 0.05)
        (0.83865122 0.020792354 0.05)
        (0.86618079 0.017519826 0.05)
        (0.89201619 0.01435122 0.05)
        (0.91578066 0.011350478 0.05)
        (0.93712769 0.0085820368 0.05)
        (0.95574597 0.0061090083 0.05)
        (0.97136401 0.0039909915 0.05)
        (0.98375406 0.0022816119 0.05)
        (0.99273545 0.0010259797 0.05)
        (0.99817722 0.00025831402 0.05)
    )
    spline 3 0
    (
        (0.49817722 -0.052306641 -0.05)
        (0.49273545 -0.05264993 -0.05)
        (0.48375406 -0.053202031 -0.05)
        (0.47136401 -0.053933221 -0.05)
        (0.45574597 -0.054802579 -0.05)
        (0.43712769 -0.055758686 -0.05)
        (0.41578066 -0.056740568 -0.05)
        (0.39201619 -0.057678906 -0.05)
        (0.36618079 -0.058497607 -0.05)
        (0.33865122 -0.059115776 -0.05)
        (0.30982892 -0.059450175 -0.05)
        (0.28013417 -0.059418152 -0.05)
        (0.25 -0.058940989 -0.05)
        (0.21986583 -0.057947524 -0.05)
        (0.19017108 -0.056377776 -0.05)
        (0.16134878 -0.054186276 -0.05)
        (0.13381921 -0.051344695 -0.05)
        (0.10798381 -0.047843432 -0.05)
        (0.084219335 -0.043691852 -0.05)
        (0.062872313 -0.038917001 -0.05)
        (0.044254034 -0.033560822 -0.05)
        (0.028635994 -0.027676067 -0.05)
        (0.016245939 -0.021321306 -0.05)
        (0.0072645456 -0.014555571 -0.05)
        (0.0018227815 -0.0074332743 -0.05)
    )
    spline 22 19
    (
        (0.49817722 -0.052306641 0.05)
        (0.49273545 -0.05264993 0.05)
        (0.48375406 -0.053202031 0.05)
        (0.47136401 -0.053933221 0.05)
        (0.45574597 -0.054802579 0.05)
        (0.43712769 -0.055758686 0.05)
        (0.41578066 -0.056740568 0.05)
        (0.39201619 -0.057678906 0.05)
        (0.36618079 -0.058497607 0.05)
        (0.33865122 -0.059115776 0.05)
        (0.30982892 -0.059450175 0.05)
        (0.28013417 -0.059418152 0.05)
        (0.25 -0.058940989 0.05)
        (0.21986583 -0.057947524 0.05)
        (0.19017108 -0.056377776 0.05)
        (0.16134878 -0.054186276 0.05)
        (0.13381921 -0.051344695 0.05)
        (0.10798381 -0.047843432 0.05)
        (0.084219335 -0.043691852 0.05)
        (0.062872313 -0.038917001 0.05)
        (0.044254034 -0.033560822 0.05)
        (0.028635994 -0.027676067 0.05)
        (0.016245939 -0.021321306 0.05)
        (0.0072645456 -0.014555571 0.05)
        (0.0018227815 -0.0074332743 0.05)
    )
    spline 1 3
    (
        (0.99817722 -0.00025831402 -0.05)
        (0.99273545 -0.0010259797 -0.05)
        (0.98375406 -0.0022816119 -0.05)
        (0.97136401 -0.0039909915 -0.05)
        (0.95574597 -0.0061090083 -0.05)
        (0.93712769 -0.0085820368 -0.05)
        (0.91578066 -0.011350478 -0.05)
        (0.89201619 -0.01435122 -0.05)
        (0.86618079 -0.017519826 -0.05)
        (0.83865122 -0.020792354 -0.05)
        (0.80982892 -0.024106778 -0.05)
        (0.78013417 -0.0274041 -0.05)
        (0.75 -0.030629248 -0.05)
        (0.71986583 -0.033731895 -0.05)
        (0.69017108 -0.036667271 -0.05)
        (0.66134878 -0.039397008 -0.05)
        (0.63381921 -0.041889956 -0.05)
        (0.60798381 -0.044122842 -0.05)
        (0.58421934 -0.046080616 -0.05)
        (0.56287231 -0.047756292 -0.05)
        (0.54425403 -0.049150166 -0.05)
        (0.52863599 -0.050268373 -0.05)
        (0.51624594 -0.051120856 -0.05)
        (0.50726455 -0.051718968 -0.05)
        (0.50182278 -0.052073029 -0.05)
    )
    spline 20 22
    (
        (0.99817722 -0.00025831402 0.05)
        (0.99273545 -0.0010259797 0.05)
        (0.98375406 -0.0022816119 0.05)
        (0.97136401 -0.0039909915 0.05)
        (0.95574597 -0.0061090083 0.05)
        (0.93712769 -0.0085820368 0.05)
        (0.91578066 -0.011350478 0.05)
        (0.89201619 -0.01435122 0.05)
        (0.86618079 -0.017519826 0.05)
        (0.83865122 -0.020792354 0.05)
        (0.80982892 -0.024106778 0.05)
        (0.78013417 -0.0274041 0.05)
        (0.75 -0.030629248 0.05)
        (0.71986583 -0.033731895 0.05)
        (0.69017108 -0.036667271 0.05)
        (0.66134878 -0.039397008 0.05)
        (0.63381921 -0.041889956 0.05)
        (0.60798381 -0.044122842 0.05)
        (0.58421934 -0.046080616 0.05)
        (0.56287231 -0.047756292 0.05)
        (0.54425403 -0.049150166 0.05)
        (0.52863599 -0.050268373 0.05)
        (0.51624594 -0.051120856 0.05)
        (0.50726455 -0.051718968 0.05)
        (0.50182278 -0.052073029 0.05)
    )
);

boundary
(
    airfoil
    {
        type wall;
        faces
        (
            (0 2 21 19)
            (2 1 20 21)
            (3 0 19 22)
            (1 3 22 20)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (10 11 30 29)
            (10 12 31 29)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (13 14 33 32)
            (13 15 34 32)
        );
    }
    topAndBottom
    {
        type patch;
        faces
        (
            (11 4 23 30)
            (4 6 25 23)
            (6 8 27 25)
            (8 17 36 27)
            (17 14 33 36)
            (12 5 24 31)
            (5 7 26 24)
            (7 9 28 26)
            (9 18 37 28)
            (18 15 34 37)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (10 0 4 11)
            (29 19 23 30)
            (0 2 6 4)
            (19 21 25 23)
            (2 1 8 6)
            (21 20 27 25)
            (1 16 17 8)
            (20 35 36 27)
            (16 13 14 17)
            (35 32 33 36)
            (10 12 5 0)
            (29 31 24 19)
            (0 5 7 3)
            (19 24 26 22)
            (3 7 9 1)
            (22 26 28 20)
            (1 9 18 16)
            (20 28 37 35)
            (16 18 15 13)
            (35 37 34 32)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
