data/cfdb/validation/naca0012_sa_tmr/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2000;
deltaT          1;

writeControl    timeStep;
writeInterval   500;
purgeWrite      2;
writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    forces
    {
        // forceCoeffs normalises by magUInf/lRef/Aref internally and writes
        // Cl/Cd to postProcessing/forces/<time>/coefficient.dat.
        // Aref = chord x 2D span thickness (1.0 x 0.1) so the result is a
        // sectional (per-unit-span) coefficient. alpha = 0, so the wind axes
        // coincide with the global axes.
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   10;

        patches         (airfoil);
        rho             rhoInf;
        log             yes;

        rhoInf          1.0;
        CofR            (0.25 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         1.0;
        lRef            1.0;
        Aref            0.1;
    }
}

// ************************************************************************* //
