data/cfdb/validation/naca0012_sa_tmr/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.01;
    }
    nuTilda
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.001;
    }
}

SIMPLE
{
    momentumPredictor yes;
    // SIMPLEC (consistent) — plain SIMPLE with under-relaxation diverged on
    // this sharp-TE structured C-grid (pressure oscillation at the nose/TE);
    // consistent + fields p relaxation is the stable combination, matching
    // the repo's turbulent_flat_plate case.
    consistent      yes;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        U               1e-5;
        p               1e-5;
        // nuTilda intentionally NOT in residualControl — the SA working
        // variable converges slowly and its residual plateau is normal on
        // wall-function meshes (same policy as the repo naca0012 templates).
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        nuTilda         0.5;
    }
}

// ************************************************************************* //
